{
            "agama": [{
    "title": "Rukun Islam",
    "summary": "Rukun Islam adalah lima dasar utama yang menjadi pondasi keislaman seseorang. Kelima rukun ini merupakan kewajiban yang harus dipenuhi oleh setiap Muslim yang telah memenuhi syarat. Rukun Islam mencakup aspek keyakinan, ibadah ritual, sosial ekonomi, dan penyempurnaan agama.\n\n1. Syahadat (Persaksian):\n- Mengucapkan dua kalimat syahadat: \"Asyhadu alla ilaha illallah wa asyhadu anna Muhammadar rasulullah\" (Aku bersaksi bahwa tidak ada Tuhan selain Allah dan aku bersaksi bahwa Muhammad adalah utusan Allah).\n- Merupakan pintu masuk Islam dan dasar dari semua rukun lainnya.\n- Mengandung dua aspek: Tauhid (mengesakan Allah) dan pengakuan atas kerasulan Muhammad SAW.\n\n2. Shalat (Sholat):\n- Mendirikan shalat lima waktu sehari semalam: Subuh, Dzuhur, Ashar, Maghrib, dan Isya.\n- Merupakan tiang agama dan penghubung langsung antara hamba dengan Allah.\n- Wajib bagi Muslim yang baligh, berakal, dan suci dari haid/nifas (bagi wanita).\n\n3. Zakat:\n- Memberikan sebagian harta kepada yang berhak menerimanya (mustahik).\n- Terdiri dari Zakat Fitrah (setiap akhir Ramadan) dan Zakat Mal (harta).\n- Bertujuan membersihkan harta, mengurangi kesenjangan sosial, dan membantu fakir miskin.\n\n4. Puasa Ramadan:\n- Menahan diri dari makan, minum, dan hal-hal yang membatalkan puasa dari terbit fajar hingga terbenam matahari selama bulan Ramadan.\n- Wajib bagi Muslim yang memenuhi syarat kecuali yang mendapat keringanan.\n- Bertujuan meningkatkan ketakwaan, empati, dan pengendalian diri.\n\n5. Haji:\n- Menunaikan ibadah haji ke Baitullah di Mekkah bagi yang mampu secara fisik, mental, dan finansial.\n- Wajib sekali seumur hidup bagi yang mampu.\n- Dilaksanakan pada bulan Dzulhijjah dengan rangkaian ritual tertentu seperti wukuf di Arafah, tawaf, dan sa'i.\n\nUrutan kelima rukun ini memiliki makna filosofis: Syahadat sebagai dasar keyakinan, Shalat sebagai ibadah individual rutin, Zakat sebagai ibadah sosial, Puasa sebagai latihan pengendalian diri, dan Haji sebagai penyempurna.\n\nRukun Islam berbeda dengan Rukun Iman yang merupakan dasar keyakinan (iman kepada Allah, malaikat, kitab-kitab, rasul, hari akhir, dan qada/qadar). Rukun Islam lebih menekankan pada praktik peribadatan, sementara Rukun Iman pada aspek akidah.",
    "questions": [
        {
            "q": "Berapa jumlah Rukun Islam yang harus diketahui dan diamalkan oleh setiap Muslim?",
            "a": "Lima"
        },
        {
            "q": "Rukun Islam yang pertama dan menjadi pintu masuk seseorang memeluk agama Islam adalah?",
            "a": "Syahadat"
        },
        {
            "q": "Shalat lima waktu yang wajib dilaksanakan umat Islam terdiri dari Subuh, Dzuhur, Ashar, Maghrib, dan?",
            "a": "Isya"
        },
        {
            "q": "Zakat yang wajib dikeluarkan setiap tahun dari harta yang dimiliki setelah mencapai nisab disebut?",
            "a": "Zakat Mal"
        },
        {
            "q": "Puasa wajib dilaksanakan umat Islam selama satu bulan penuh pada bulan?",
            "a": "Ramadan"
        },
        {
            "q": "Ibadah haji dilaksanakan di kota suci?",
            "a": "Mekkah"
        },
        {
            "q": "Rukun Islam yang menjadi kewajiban sekali seumur hidup bagi yang mampu adalah?",
            "a": "Haji"
        },
        {
            "q": "Dua kalimat yang diucapkan dalam syahadat adalah persaksian bahwa tidak ada Tuhan selain Allah dan bahwa Muhammad adalah?",
            "a": "Utusan Allah/Rasulullah"
        },
        {
            "q": "Zakat yang wajib dikeluarkan menjelang Idul Fitri berupa makanan pokok disebut?",
            "a": "Zakat Fitrah"
        },
        {
            "q": "Rukun Islam yang dilaksanakan pada bulan Dzulhijjah dan merupakan penyempurna agama adalah?",
            "a": "Haji"
        }
    ]
},
                     {
    "title": "Rukun Iman",
    "summary": "Rukun Iman adalah enam dasar keyakinan dalam agama Islam yang harus diyakini dan diimani oleh setiap Muslim. Rukun Iman merupakan pondasi akidah (keyakinan) yang membedakan seorang Muslim dari penganut agama lain. Keyakinan terhadap Rukun Iman harus tertanam dalam hati, diucapkan dengan lisan, dan dibuktikan dengan amal perbuatan.\n\n1. Iman kepada Allah SWT:\n- Mengimani keberadaan Allah sebagai satu-satunya Tuhan yang berhak disembah (tauhid).\n- Meyakini sifat-sifat Allah yang sempurna (Asmaul Husna).\n- Mengimani bahwa Allah adalah pencipta, pemelihara, dan penguasa alam semesta.\n- Menolak segala bentuk syirik (menyekutukan Allah).\n\n2. Iman kepada Malaikat Allah:\n- Meyakini keberadaan malaikat sebagai makhluk gaib yang diciptakan dari cahaya (nur).\n- Mengimani tugas-tugas khusus yang diberikan Allah kepada masing-masing malaikat.\n- Meyakini bahwa malaikat selalu taat dan tidak pernah bermaksiat kepada Allah.\n- Mengetahui nama dan tugas 10 malaikat yang wajib diketahui.\n\n3. Iman kepada Kitab-Kitab Allah:\n- Meyakini bahwa Allah menurunkan kitab-kitab suci kepada rasul-rasul-Nya sebagai pedoman hidup.\n- Mengimani empat kitab utama: Taurat (Musa), Zabur (Daud), Injil (Isa), dan Al-Quran (Muhammad SAW).\n- Meyakini bahwa Al-Quran adalah kitab terakhir yang menyempurnakan kitab-kitab sebelumnya dan terjaga keasliannya.\n\n4. Iman kepada Rasul-Rasul Allah:\n- Meyakini bahwa Allah mengutus para rasul untuk menyampaikan wahyu dan menjadi teladan bagi umat manusia.\n- Mengimani 25 rasul yang disebutkan dalam Al-Quran.\n- Meyakini bahwa Nabi Muhammad SAW adalah rasul terakhir (khatamun-nabiyyin).\n- Membedakan antara nabi dan rasul: semua rasul adalah nabi, tetapi tidak semua nabi adalah rasul.\n\n5. Iman kepada Hari Kiamat (Hari Akhir):\n- Meyakini bahwa alam semesta dan kehidupan dunia akan berakhir (kiamat).\n- Mengimani proses setelah kematian: alam barzakh, kebangkitan, hisab (perhitungan amal), mizan (timbangan), shirat (jembatan), dan surga/neraka.\n- Meyakini bahwa kehidupan akhirat adalah kehidupan yang kekal dan abadi.\n\n6. Iman kepada Qada dan Qadar (Takdir):\n- Mengimani bahwa segala sesuatu yang terjadi di alam semesta telah ditetapkan oleh Allah.\n- Memahami perbedaan qada (ketetapan Allah yang bersifat umum) dan qadar (ketetapan Allah yang bersifat khusus dan detail).\n- Meyakini bahwa manusia memiliki ikhtiar (usaha) dan pilihan, tetapi hasil akhir tetap dalam ketentuan Allah.\n- Menghindari pemahaman fatalisme ekstrem (jabariyah) dan liberalisme ekstrem (qadariyah).\n\nUrutan Rukun Iman tidak boleh diubah karena memiliki logika berurutan: Keyakinan kepada Allah sebagai dasar utama, kemudian mengimani perantara wahyu (malaikat), sumber pedoman (kitab), penyampai pedoman (rasul), tujuan akhir (hari kiamat), dan ketentuan Allah (takdir).\n\nPerbedaan mendasar antara Rukun Islam dan Rukun Iman: Rukun Islam bersifat praktis dan terdiri dari amal ibadah fisik, sedangkan Rukun Iman bersifat keyakinan dalam hati. Rukun Islam dapat dilihat oleh orang lain, sedangkan Rukun Iman adalah urusan antara hamba dengan Allah. Namun keduanya saling melengkapi dan tidak dapat dipisahkan.",
    "questions": [
        {
            "q": "Berapa jumlah Rukun Iman yang harus diyakini oleh setiap Muslim?",
            "a": "Enam"
        },
        {
            "q": "Rukun Iman yang pertama dan paling utama adalah iman kepada?",
            "a": "Allah SWT"
        },
        {
            "q": "Malaikat adalah makhluk Allah yang diciptakan dari apa?",
            "a": "Cahaya (nur)"
        },
        {
            "q": "Berapa jumlah malaikat yang wajib diketahui nama dan tugasnya oleh setiap Muslim?",
            "a": "Sepuluh"
        },
        {
            "q": "Kitab suci apakah yang diturunkan Allah kepada Nabi Musa AS?",
            "a": "Taurat"
        },
        {
            "q": "Kitab suci terakhir yang diturunkan Allah kepada Nabi Muhammad SAW adalah?",
            "a": "Al-Quran"
        },
        {
            "q": "Berapa jumlah rasul Allah yang wajib diketahui oleh setiap Muslim?",
            "a": "25 rasul"
        },
        {
            "q": "Nabi dan rasul terakhir yang diutus Allah untuk seluruh umat manusia adalah?",
            "a": "Nabi Muhammad SAW"
        },
        {
            "q": "Hari ketika seluruh alam semesta hancur dan semua makhluk dibangkitkan disebut hari?",
            "a": "Kiamat"
        },
        {
            "q": "Tempat perhitungan amal manusia setelah dibangkitkan dari kubur disebut?",
            "a": "Hisab"
        },
        {
            "q": "Jembatan yang harus dilewati manusia menuju surga disebut?",
            "a": "Shirat"
        },
        {
            "q": "Ketetapan Allah yang bersifat umum dan sudah ditentukan sejak zaman azali disebut?",
            "a": "Qada"
        },
        {
            "q": "Ketetapan Allah yang bersifat detail dan spesifik terhadap setiap makhluk disebut?",
            "a": "Qadar"
        },
        {
            "q": "Malaikat yang bertugas menyampaikan wahyu dari Allah kepada para nabi dan rasul adalah?",
            "a": "Malaikat Jibril"
        },
        {
            "q": "Malaikat yang bertugas meniup sangkakala (terompet) pada hari kiamat adalah?",
            "a": "Malaikat Israfil"
        },
        {
            "q": "Kitab suci apakah yang diturunkan Allah kepada Nabi Daud AS?",
            "a": "Zabur"
        },
        {
            "q": "Nabi yang menerima kitab Injil dari Allah adalah?",
            "a": "Nabi Isa AS"
        },
        {
            "q": "Peristiwa ketika manusia dikumpulkan di Padang Mahsyar untuk mempertanggungjawabkan amal perbuatannya disebut?",
            "a": "Yaumul Mahsyar"
        },
        {
            "q": "Alam antara dunia dan akhirat dimana manusia menunggu hari kebangkitan disebut?",
            "a": "Alam Barzakh"
        },
        {
            "q": "Kepercayaan bahwa segala sesuatu terjadi karena kehendak Allah tetapi manusia tetap memiliki usaha dan pilihan disebut?",
            "a": "Iman kepada Qada dan Qadar"
        }
    ]
},
                     {
    "title": "Malaikat Allah: Nama dan Tugasnya",
    "summary": "Malaikat adalah makhluk ciptaan Allah SWT yang terbuat dari cahaya (nur), bersifat gaib, tidak berjenis kelamin, tidak makan dan minum, tidak tidur, selalu taat dan patuh kepada Allah, serta tidak pernah berbuat dosa. Keberadaan malaikat merupakan bagian dari Rukun Iman yang kedua, dan setiap Muslim wajib mengimani malaikat-malaikat Allah.\n\nBerikut adalah 10 malaikat yang wajib diketahui beserta tugas-tugasnya:\n\n1. Malaikat Jibril (جِبْرِيلُ)\n- Tugas utama: Menyampaikan wahyu dari Allah SWT kepada para nabi dan rasul.\n- Disebut juga sebagai Ruhul Qudus (Roh Kudus).\n- Bertugas mengatur angin dan menurunkan hujan.\n\n2. Malaikat Mikail (مِيكَائِيلُ)\n- Tugas utama: Mengatur rezeki semua makhluk hidup.\n- Bertugas mengatur hujan, tumbuhan, dan cuaca.\n- Mendistribusikan rezeki sesuai ketentuan Allah.\n\n3. Malaikat Israfil (إِسْرَافِيلُ)\n- Tugas utama: Meniup sangkakala (terompet) pada hari kiamat.\n- Tiupan pertama: Menghancurkan alam semesta (kiamat).\n- Tiupan kedua: Membangkitkan manusia dari kubur.\n\n4. Malaikat Izrail (عِزْرَائِيلُ)\n- Tugas utama: Mencabut nyawa semua makhluk hidup.\n- Disebut juga Malaikat Maut.\n- Bertugas sesuai perintah Allah tanpa penundaan.\n\n5. Malaikat Munkar (مُنْكَرُ)\n- Tugas utama: Menanyai manusia di alam kubur bersama Malaikat Nakir.\n- Menanyai tentang Tuhan, agama, dan nabi orang tersebut.\n- Datang dengan wajah menakutkan bagi orang yang durhaka.\n\n6. Malaikat Nakir (نَكِيرُ)\n- Tugas utama: Menanyai manusia di alam kubur bersama Malaikat Munkar.\n- Proses pemeriksaan ini disebut fitnah kubur.\n- Orang yang beriman akan dipermudah dalam menjawab.\n\n7. Malaikat Raqib (رَقِيبُ)\n- Tugas utama: Mencatat semua amal baik manusia.\n- Selalu mendampingi manusia di sebelah kanan.\n- Mencatat sejak manusia baligh hingga meninggal.\n\n8. Malaikat Atid (عَتِيدُ)\n- Tugas utama: Mencatat semua amal buruk manusia.\n- Selalu mendampingi manusia di sebelah kiri.\n- Pencatatan dilakukan dengan sangat teliti.\n\n9. Malaikat Malik (مَالِكُ)\n- Tugas utama: Menjaga pintu neraka.\n- Memimpin para malaikat zabaniyah (penyiksa neraka).\n- Memiliki wajah yang sangat menakutkan.\n\n10. Malaikat Ridwan (رِضْوَانُ)\n- Tugas utama: Menjaga pintu surga.\n- Memimpin para malaikat yang melayani penghuni surga.\n- Memiliki wajah yang berseri-seri.\n\nKarakteristik umum malaikat:\n- Diciptakan sebelum manusia (Adam AS).\n- Tidak memiliki hawa nafsu.\n- Dapat berubah wujud atas izin Allah.\n- Jumlahnya sangat banyak, hanya Allah yang mengetahui.\n- Beberapa malaikat memiliki tugas khusus seperti malaikat pembawa Arsy, malaikat yang bertasbih terus menerus, dan malaikat pencatat dalam kandungan.\n\nPerbedaan malaikat dengan jin dan manusia:\n- Malaikat selalu taat, jin ada yang taat dan durhaka (setan), manusia ada yang beriman dan kafir.\n- Malaikat dari cahaya, jin dari api, manusia dari tanah.\n- Malaikat tidak berjenis kelamin, jin dan manusia memiliki jenis kelamin.\n\nMengimani malaikat berarti meyakini keberadaan mereka meski tidak terlihat, mengetahui nama dan tugas mereka, serta memahami bahwa mereka adalah makhluk yang selalu melaksanakan perintah Allah.",
    "questions": [
        {
            "q": "Dari apakah malaikat diciptakan oleh Allah SWT?",
            "a": "Cahaya (nur)"
        },
        {
            "q": "Berapa jumlah malaikat yang wajib diketahui nama dan tugasnya oleh setiap Muslim?",
            "a": "10 malaikat"
        },
        {
            "q": "Malaikat apakah yang bertugas menyampaikan wahyu kepada para nabi dan rasul?",
            "a": "Malaikat Jibril"
        },
        {
            "q": "Malaikat yang bertugas mengatur rezeki semua makhluk hidup adalah?",
            "a": "Malaikat Mikail"
        },
        {
            "q": "Malaikat peniup sangkakala (terompet) pada hari kiamat adalah?",
            "a": "Malaikat Israfil"
        },
        {
            "q": "Malaikat yang bertugas mencabut nyawa disebut juga malaikat?",
            "a": "Malaikat Izrail (Malaikat Maut)"
        },
        {
            "q": "Malaikat apakah yang bersama Malaikat Nakir menanyai manusia di alam kubur?",
            "a": "Malaikat Munkar"
        },
        {
            "q": "Malaikat yang mencatat amal baik manusia dan berada di sebelah kanan adalah?",
            "a": "Malaikat Raqib"
        },
        {
            "q": "Malaikat yang mencatat amal buruk manusia dan berada di sebelah kiri adalah?",
            "a": "Malaikat Atid"
        },
        {
            "q": "Malaikat penjaga pintu neraka adalah?",
            "a": "Malaikat Malik"
        },
        {
            "q": "Malaikat penjaga pintu surga adalah?",
            "a": "Malaikat Ridwan"
        },
        {
            "q": "Malaikat yang juga disebut sebagai Ruhul Qudus adalah?",
            "a": "Malaikat Jibril"
        },
        {
            "q": "Proses pemeriksaan di alam kubur oleh Malaikat Munkar dan Nakir disebut?",
            "a": "Fitnah kubur"
        },
        {
            "q": "Malaikat yang bertugas mengatur angin dan menurunkan hujan adalah?",
            "a": "Malaikat Jibril (dan juga Mikail)"
        },
        {
            "q": "Tiupan pertama sangkakala oleh Malaikat Israfil menyebabkan?",
            "a": "Hancurnya alam semesta (kiamat)"
        },
        {
            "q": "Tiupan kedua sangkakala oleh Malaikat Israfil menyebabkan?",
            "a": "Kebangkitan manusia dari kubur"
        },
        {
            "q": "Selain mencatat amal baik, Malaikat Raqib juga dikenal sebagai malaikat yang selalu?",
            "a": "Mendampingi manusia di sebelah kanan"
        },
        {
            "q": "Malaikat yang memimpin para malaikat zabaniyah (penyiksa di neraka) adalah?",
            "a": "Malaikat Malik"
        },
        {
            "q": "Malaikat yang wajahnya berseri-seri karena bertugas menjaga surga adalah?",
            "a": "Malaikat Ridwan"
        },
        {
            "q": "Mengimani malaikat termasuk dalam rukun iman yang ke?",
            "a": "Kedua"
        }
    ]
},
                     {
    "title": "25 Nabi dan Rasul Beserta Mukjizatnya",
    "summary": "Nabi dan Rasul adalah manusia pilihan Allah yang diutus untuk menyampaikan wahyu dan membimbing umat manusia ke jalan yang benar. Perbedaan utama antara nabi dan rasul adalah: Nabi menerima wahyu untuk dirinya sendiri atau menguatkan syariat sebelumnya, sedangkan Rasul menerima wahyu untuk disampaikan kepada umatnya dengan membawa syariat baru. Semua Rasul adalah Nabi, tetapi tidak semua Nabi adalah Rasul. Umat Islam wajib mengimani 25 Nabi dan Rasul yang disebutkan dalam Al-Quran, meskipun jumlah sebenarnya lebih banyak.\n\nBerikut adalah 25 Nabi dan Rasul beserta mukjizat utama mereka:\n\n1. Nabi Adam AS\n   - Bapak seluruh manusia, diciptakan tanpa ayah dan ibu\n   - Mukjizat: Diciptakan langsung oleh Allah dari tanah, diajarkan nama-nama segala sesuatu, dan ditempatkan di surga\n\n2. Nabi Idris AS\n   - Nabi pertama yang menulis dengan pena\n   - Mukjizat: Diangkat ke langit dan diperlihatkan surga-neraka saat masih hidup\n\n3. Nabi Nuh AS\n   - Berdakwah selama 950 tahun, umatnya selamat dari banjir besar\n   - Mukjizat: Membuat bahtera besar yang menyelamatkan orang beriman dan hewan-hewan dari banjir bandang\n\n4. Nabi Hud AS\n   - Diutus kepada kaum 'Ad di Al-Ahqaf\n   - Mukjizat: Doanya untuk menghukum kaum 'Ad yang durhaka dikabulkan dengan angin topan selama 7 malam 8 hari\n\n5. Nabi Shaleh AS\n   - Diutus kepada kaum Tsamud\n   - Mukjizat: Mengeluarkan unta betina dari batu besar sebagai tanda kerasulannya\n\n6. Nabi Ibrahim AS\n   - Bapak para Nabi (Abul Anbiya'), penghancur berhala\n   - Mukjizat: Tidak hangus dibakar api, doanya untuk kota Makkah dikabulkan, Ismail dan Ishaq lahir di usia tua\n\n7. Nabi Luth AS\n   - Keponakan Nabi Ibrahim, diutus ke kota Sadum\n   - Mukjizat: Diselamatkan dari azab yang menimpa kaumnya, istrinya berubah menjadi tiang garam\n\n8. Nabi Ismail AS\n   - Putra Nabi Ibrahim, bersama ayahnya membangun Ka'bah\n   - Mukjizat: Air zam-zam muncul dari hentakan kakinya saat bayi kehausan\n\n9. Nabi Ishaq AS\n   - Putra Nabi Ibrahim, ayah dari Nabi Ya'qub\n   - Mukjizat: Lahir dari ibu (Sarah) yang sebelumnya mandul dan sudah tua\n\n10. Nabi Ya'qub AS\n    - Putra Nabi Ishaq, memiliki 12 anak yang menjadi cikal bakal 12 suku Israel\n    - Mukjizat: Dikaruniai ilmu dan keturunan yang banyak\n\n11. Nabi Yusuf AS\n    - Putra Nabi Ya'qub, memiliki ketampanan luar biasa\n    - Mukjizat: Menakwilkan mimpi, selamat dari sumur dan fitnah, menjadi penguasa Mesir\n\n12. Nabi Ayyub AS\n    - Nabi yang sangat sabar menghadapi ujian\n    - Mukjizat: Disembuhkan dari penyakit parah setelah bertahun-tahun, kekayaan dikembalikan berlipat\n\n13. Nabi Syu'aib AS\n    - Diutus kepada kaum Madyan\n    - Mukjizat: Doanya dikabulkan dengan azab panas menyengat dan awan hitam bagi kaumnya\n\n14. Nabi Musa AS\n    - Nabi yang menerima kitab Taurat, pemimpin Bani Israel\n    - Mukjizat: Tongkat berubah jadi ular besar, tangan bercahaya, membelah laut, mengeluarkan air dari batu\n\n15. Nabi Harun AS\n    - Saudara Nabi Musa, ahli pidato yang mendampingi Musa\n    - Mukjizat: Memiliki kemampuan bahasa yang luar biasa untuk mendakwahi Firaun\n\n16. Nabi Dzulkifli AS\n    - Nabi yang sangat sabar dan teguh pendirian\n    - Mukjizat: Diberi kesabaran luar biasa dalam menghadapi ujian\n\n17. Nabi Daud AS\n    - Raja dan Nabi, menerima kitab Zabur\n    - Mukjizat: Melembutkan besi dengan tangan, suara merdu, mengalahkan Jalut\n\n18. Nabi Sulaiman AS\n    - Putra Nabi Daud, raja terkaya dan terkuat\n    - Mukjizat: Memahami bahasa hewan, menguasai angin dan jin, ratu Bilqis takluk padanya\n\n19. Nabi Ilyas AS\n    - Diutus kepada kaum penyembah berhala Ba'al\n    - Mukjizat: Doanya menghentikan hujan selama bertahun-tahun sebagai azab\n\n20. Nabi Ilyasa' AS\n    - Pengganti Nabi Ilyas\n    - Mukjizat: Mampu menghidupkan orang mati dengan izin Allah\n\n21. Nabi Yunus AS\n    - Ditelan ikan paus setelah meninggalkan kaumnya\n    - Mukjizat: Hidup dalam perut ikan paus selama beberapa hari, kemudian diselamatkan\n\n22. Nabi Zakaria AS\n    - Nabi yang menjaga Maryam, ayah Nabi Yahya\n    - Mukjizat: Dikaruniai anak di usia sangat tua (Yahya)\n\n23. Nabi Yahya AS\n    - Putra Nabi Zakaria, lahir dari ibu yang mandul\n    - Mukjizat: Lahir secara ajaib, menjadi nabi sejak kecil, sangat takwa\n\n24. Nabi Isa AS\n    - Putra Maryam, menerima kitab Injil\n    - Mukjizat: Lahir tanpa ayah, berbicara saat bayi, menyembuhkan orang buta, menghidupkan orang mati, membuat burung dari tanah\n\n25. Nabi Muhammad SAW\n    - Nabi terakhir, penutup para Nabi (Khatamul Anbiya)\n    - Mukjizat: Al-Quran (mukjizat terbesar), Isra' Mi'raj, membelah bulan, air mengalir dari jari, makan sedikit mengenyangkan banyak orang\n\nMukjizat adalah kejadian luar biasa yang diberikan Allah kepada para Nabi dan Rasul untuk membuktikan kerasulan mereka. Mukjizat bersifat kebenaran dari Allah, bukan sihir atau tipu daya. Mukjizat terbesar sepanjang masa adalah Al-Quran yang diturunkan kepada Nabi Muhammad SAW, yang terjaga keasliannya sampai hari kiamat.",
    "questions": [
        {
            "q": "Siapakah nabi pertama yang diutus Allah SWT kepada manusia?",
            "a": "Nabi Adam AS"
        },
        {
            "q": "Nabi yang membuat bahtera besar untuk menyelamatkan pengikutnya dari banjir bandang adalah?",
            "a": "Nabi Nuh AS"
        },
        {
            "q": "Nabi yang tidak hangus dibakar api karena perlindungan Allah adalah?",
            "a": "Nabi Ibrahim AS"
        },
        {
            "q": "Nabi yang mukjizatnya mengeluarkan unta betina dari batu besar adalah?",
            "a": "Nabi Shaleh AS"
        },
        {
            "q": "Air zam-zam muncul pertama kali dari hentakan kaki bayi yang kehausan, yaitu bayi nabi?",
            "a": "Nabi Ismail AS"
        },
        {
            "q": "Nabi yang memiliki ketampanan luar biasa dan mampu menakwilkan mimpi adalah?",
            "a": "Nabi Yusuf AS"
        },
        {
            "q": "Nabi yang terkenal dengan kesabarannya menghadapi ujian penyakit parah adalah?",
            "a": "Nabi Ayyub AS"
        },
        {
            "q": "Nabi yang membelah laut dengan tongkatnya untuk menyelamatkan Bani Israel dari kejaran Firaun adalah?",
            "a": "Nabi Musa AS"
        },
        {
            "q": "Nabi yang mampu melembutkan besi dengan tangannya dan memiliki suara merdu adalah?",
            "a": "Nabi Daud AS"
        },
        {
            "q": "Nabi yang memahami bahasa hewan dan menguasai angin serta jin adalah?",
            "a": "Nabi Sulaiman AS"
        },
        {
            "q": "Nabi yang hidup dalam perut ikan paus selama beberapa hari kemudian diselamatkan Allah adalah?",
            "a": "Nabi Yunus AS"
        },
        {
            "q": "Nabi yang lahir tanpa ayah dan sudah bisa berbicara saat masih bayi adalah?",
            "a": "Nabi Isa AS"
        },
        {
            "q": "Nabi terakhir dan penutup para nabi yang menerima mukjizat terbesar Al-Quran adalah?",
            "a": "Nabi Muhammad SAW"
        },
        {
            "q": "Peristiwa perjalanan Nabi Muhammad SAW dari Masjidil Haram ke Masjidil Aqsa lalu naik ke langit disebut?",
            "a": "Isra' Mi'raj"
        },
        {
            "q": "Nabi yang ditugaskan untuk menghancurkan berhala-berhala yang disembah kaumnya adalah?",
            "a": "Nabi Ibrahim AS"
        },
        {
            "q": "Nabi yang doanya menghancurkan kaum 'Ad dengan angin topan selama 7 malam 8 hari adalah?",
            "a": "Nabi Hud AS"
        },
        {
            "q": "Nabi yang ayahnya (Zakaria) dikaruniai anak di usia sangat tua adalah?",
            "a": "Nabi Yahya AS"
        },
        {
            "q": "Nabi yang bersama ayahnya (Ibrahim) membangun Ka'bah adalah?",
            "a": "Nabi Ismail AS"
        },
        {
            "q": "Nabi yang menerima kitab Taurat dari Allah SWT adalah?",
            "a": "Nabi Musa AS"
        },
        {
            "q": "Berapa jumlah nabi dan rasul yang wajib diketahui dan diimani oleh setiap Muslim?",
            "a": "25 nabi dan rasul"
        }
    ]
}
